tap "adoptopenjdk/openjdk"
tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "th-ch/youtube-music"
tap "tw93/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Configurable static site generator
brew "hugo"
# Tool to report network interface bandwidth
brew "ifstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Media player based on MPlayer and mplayer2
brew "mpv", link: false
# Node version management
brew "n"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@21"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Coreutils progress viewer
brew "progress"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Open source continuous file synchronization application
brew "syncthing"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Telegram client with ghost mode and message history
cask "ayugram"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Code editor
cask "codeedit"
# Universal database tool and SQL client
cask "dbeaver-community"
# All-in-one toolbox for developers
cask "devutils"
# Window peeking utility app
cask "dockdoor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Finds duplicate files in a computer system
cask "dupeguru"
# Web browser
cask "firefox"
# Privacy-focused Firefox-based browser
cask "floorp"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-lxgw-neoxihei"
cask "font-lxgw-simzhisong"
cask "font-lxgw-wenkai"
cask "font-lxgw-wenkai-mono-tc"
cask "font-maple-mono"
cask "font-maple-mono-cn"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# GPU-based terminal emulator
cask "kitty"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Utility that provides NTFS read and write support
cask "ntfstool"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Android file transfer
cask "openmtp"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Instant messaging tool
cask "qq"
# Archive manager for data compression and backups
cask "rar"
# Snip or pin screenshots
cask "snipaste"
# Music streaming service
cask "spotify"
# Rime input method engine
cask "squirrel-app"
# Video game digital distribution service
cask "steam"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Terminal emulator, SSH and serial client
cask "tabby"
# AI image upscaler
cask "upscayl"
# Open-source code editor
cask "visual-studio-code"
# YouTube Music Desktop App
cask "youtube-music"
vscode "alefragnani.project-manager"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dongfg.vscode-beancount-formatter"
vscode "ecmel.vscode-html-css"
vscode "edwinsulaiman.jetbrains-rider-dark-theme"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "kamikillerto.vscode-colorize"
vscode "lencerf.beancount"
vscode "lkrms.inifmt"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "vue.volar"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
